Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/iLLD_39A/Tricore/_Impl/IfxScu_cfg.h
#ifndef IFXSCU_CFG_BBBDIV_300MHZ
/** \brief Macro to configure BBBDIV at 300MHz target frequency */
#define IFXSCU_CFG_BBBDIV_300MHZ            (IFXSCU_CFG_SRIDIV_300MHZ * 2)
#endif /*#ifndef IFXSCU_CFG_BBBDIV_300MHZ */

#ifndef IFXSCU_CFG_CPU0DIV_80MHZ
/** \brief Macro to configure CPU0DIV at 80MHz target frequency */
#define IFXSCU_CFG_CPU0DIV_80MHZ            (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU0DIV_80MHZ */

#ifndef IFXSCU_CFG_CPU0DIV_133MHZ
/** \brief Macro to configure CPU0DIV at 133MHz target frequency */
#define IFXSCU_CFG_CPU0DIV_133MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU0DIV_133MHZ */

#ifndef IFXSCU_CFG_CPU0DIV_160MHZ
/** \brief Macro to configure CPU0DIV at 160MHz target frequency */
#define IFXSCU_CFG_CPU0DIV_160MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU0DIV_160MHZ */

#ifndef IFXSCU_CFG_CPU0DIV_200MHZ
/** \brief Macro to configure CPU0DIV at 200MHz target frequency */
#define IFXSCU_CFG_CPU0DIV_200MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU0DIV_200MHZ */

#ifndef IFXSCU_CFG_CPU0DIV_240MHZ
/** \brief Macro to configure CPU0DIV at 240MHz target frequency */
#define IFXSCU_CFG_CPU0DIV_240MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU0DIV_240MHZ */

#ifndef IFXSCU_CFG_CPU0DIV_300MHZ
/** \brief Macro to configure CPU0DIV at 300MHz target frequency */
#define IFXSCU_CFG_CPU0DIV_300MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU0DIV_300MHZ */

#ifndef IFXSCU_CFG_CPU1DIV_80MHZ
/** \brief Macro to configure CPU1DIV at 80MHz target frequency */
#define IFXSCU_CFG_CPU1DIV_80MHZ            (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU1DIV_80MHZ */

#ifndef IFXSCU_CFG_CPU1DIV_133MHZ
/** \brief Macro to configure CPU1DIV at 133MHz target frequency */
#define IFXSCU_CFG_CPU1DIV_133MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU1DIV_133MHZ */

#ifndef IFXSCU_CFG_CPU1DIV_160MHZ
/** \brief Macro to configure CPU1DIV at 160MHz target frequency */
#define IFXSCU_CFG_CPU1DIV_160MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU1DIV_160MHZ */

#ifndef IFXSCU_CFG_CPU1DIV_200MHZ
/** \brief Macro to configure CPU1DIV at 200MHz target frequency */
#define IFXSCU_CFG_CPU1DIV_200MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU1DIV_200MHZ */

#ifndef IFXSCU_CFG_CPU1DIV_240MHZ
/** \brief Macro to configure CPU1DIV at 240MHz target frequency */
#define IFXSCU_CFG_CPU1DIV_240MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU1DIV_240MHZ */

#ifndef IFXSCU_CFG_CPU1DIV_300MHZ
/** \brief Macro to configure CPU1DIV at 300MHz target frequency */
#define IFXSCU_CFG_CPU1DIV_300MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU1DIV_300MHZ */

#ifndef IFXSCU_CFG_CPU2DIV_80MHZ
/** \brief Macro to configure CPU2DIV at 80MHz target frequency */
#define IFXSCU_CFG_CPU2DIV_80MHZ            (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU2DIV_80MHZ */

#ifndef IFXSCU_CFG_CPU2DIV_133MHZ
/** \brief Macro to configure CPU2DIV at 133MHz target frequency */
#define IFXSCU_CFG_CPU2DIV_133MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU2DIV_133MHZ */

#ifndef IFXSCU_CFG_CPU2DIV_160MHZ
/** \brief Macro to configure CPU2DIV at 160MHz target frequency */
#define IFXSCU_CFG_CPU2DIV_160MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU2DIV_160MHZ */

#ifndef IFXSCU_CFG_CPU2DIV_200MHZ
/** \brief Macro to configure CPU2DIV at 200MHz target frequency */
#define IFXSCU_CFG_CPU2DIV_200MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU2DIV_200MHZ */

#ifndef IFXSCU_CFG_CPU2DIV_240MHZ
/** \brief Macro to configure CPU2DIV at 240MHz target frequency */
#define IFXSCU_CFG_CPU2DIV_240MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU2DIV_240MHZ */

#ifndef IFXSCU_CFG_CPU2DIV_300MHZ
/** \brief Macro to configure CPU2DIV at 300MHz target frequency */
#define IFXSCU_CFG_CPU2DIV_300MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU2DIV_300MHZ */

#ifndef IFXSCU_CFG_CPU3DIV_80MHZ
/** \brief Macro to configure CPU3DIV at 80MHz target frequency */
#define IFXSCU_CFG_CPU3DIV_80MHZ            (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU3DIV_80MHZ */

#ifndef IFXSCU_CFG_CPU3DIV_133MHZ
/** \brief Macro to configure CPU3DIV at 133MHz target frequency */
#define IFXSCU_CFG_CPU3DIV_133MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU3DIV_133MHZ */

#ifndef IFXSCU_CFG_CPU3DIV_160MHZ
/** \brief Macro to configure CPU3DIV at 160MHz target frequency */
#define IFXSCU_CFG_CPU3DIV_160MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU3DIV_160MHZ */

#ifndef IFXSCU_CFG_CPU3DIV_200MHZ
/** \brief Macro to configure CPU3DIV at 200MHz target frequency */
#define IFXSCU_CFG_CPU3DIV_200MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU3DIV_200MHZ */

#ifndef IFXSCU_CFG_CPU3DIV_240MHZ
/** \brief Macro to configure CPU3DIV at 240MHz target frequency */
#define IFXSCU_CFG_CPU3DIV_240MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU3DIV_240MHZ */

#ifndef IFXSCU_CFG_CPU3DIV_300MHZ
/** \brief Macro to configure CPU3DIV at 300MHz target frequency */
#define IFXSCU_CFG_CPU3DIV_300MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU3DIV_300MHZ */

#ifndef IFXSCU_CFG_CPU4DIV_80MHZ
/** \brief Macro to configure CPU4DIV at 80MHz target frequency */
#define IFXSCU_CFG_CPU4DIV_80MHZ            (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU4DIV_80MHZ */

#ifndef IFXSCU_CFG_CPU4DIV_133MHZ
/** \brief Macro to configure CPU4DIV at 133MHz target frequency */
#define IFXSCU_CFG_CPU4DIV_133MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU4DIV_133MHZ */

#ifndef IFXSCU_CFG_CPU4DIV_160MHZ
/** \brief Macro to configure CPU4DIV at 160MHz target frequency */
#define IFXSCU_CFG_CPU4DIV_160MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU4DIV_160MHZ */

#ifndef IFXSCU_CFG_CPU4DIV_200MHZ
/** \brief Macro to configure CPU4DIV at 200MHz target frequency */
#define IFXSCU_CFG_CPU4DIV_200MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU4DIV_200MHZ */

#ifndef IFXSCU_CFG_CPU4DIV_240MHZ
/** \brief Macro to configure CPU4DIV at 240MHz target frequency */
#define IFXSCU_CFG_CPU4DIV_240MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU4DIV_240MHZ */

