Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/iLLD_39A/Tricore/_Impl/IfxScu_cfg.h
#ifndef IFXSCU_CFG_CPU4DIV_300MHZ
/** \brief Macro to configure CPU4DIV at 300MHz target frequency */
#define IFXSCU_CFG_CPU4DIV_300MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU4DIV_300MHZ */

#ifndef IFXSCU_CFG_CPU5DIV_80MHZ
/** \brief Macro to configure CPU5DIV at 80MHz target frequency */
#define IFXSCU_CFG_CPU5DIV_80MHZ            (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU5DIV_80MHZ */

#ifndef IFXSCU_CFG_CPU5DIV_133MHZ
/** \brief Macro to configure CPU5DIV at 133MHz target frequency */
#define IFXSCU_CFG_CPU5DIV_133MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU5DIV_133MHZ */

#ifndef IFXSCU_CFG_CPU5DIV_160MHZ
/** \brief Macro to configure CPU5DIV at 160MHz target frequency */
#define IFXSCU_CFG_CPU5DIV_160MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU5DIV_160MHZ */

#ifndef IFXSCU_CFG_CPU5DIV_200MHZ
/** \brief Macro to configure CPU5DIV at 200MHz target frequency */
#define IFXSCU_CFG_CPU5DIV_200MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU5DIV_200MHZ */

#ifndef IFXSCU_CFG_CPU5DIV_240MHZ
/** \brief Macro to configure CPU5DIV at 240MHz target frequency */
#define IFXSCU_CFG_CPU5DIV_240MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU5DIV_240MHZ */

#ifndef IFXSCU_CFG_CPU5DIV_300MHZ
/** \brief Macro to configure CPU5DIV at 300MHz target frequency */
#define IFXSCU_CFG_CPU5DIV_300MHZ           (0) /*Same as SRIDIV */
#endif /*#ifndef IFXSCU_CFG_CPU5DIV_300MHZ */

// ASCLINF => fsource2
#ifndef IFXSCU_CFG_ASCLINFDIV_320MHZ_200MHZ
/** \brief Macro to configure ASCLINFDIV at 200MHz target frequency */
#define IFXSCU_CFG_ASCLINFDIV_320MHZ_200MHZ (1)
#endif /*#ifndef IFXSCU_CFG_ASCLINFDIV_320MHZ_200MHZ */

#ifndef IFXSCU_CFG_ASCLINFDIV_160MHZ_200MHZ
/** \brief Macro to configure ASCLINFDIV at 200MHz target frequency */
#define IFXSCU_CFG_ASCLINFDIV_160MHZ_200MHZ (1)
#endif /*#ifndef IFXSCU_CFG_ASCLINFDIV_160MHZ_200MHZ */

// ASCLINS => fsource1
#ifndef IFXSCU_CFG_ASCLINSDIV_320MHZ_200MHZ
/** \brief Macro to configure ASCLINSDIV at 320MHz target frequency */
#define IFXSCU_CFG_ASCLINSDIV_320MHZ_200MHZ (4)         /*80MHz */
#endif /*#ifndef IFXSCU_CFG_ASCLINSDIV_320MHZ_200MHZ */

#ifndef IFXSCU_CFG_ASCLINSDIV_160MHZ_200MHZ
/** \brief Macro to configure ASCLINSDIV at 160MHz target frequency */
#define IFXSCU_CFG_ASCLINSDIV_160MHZ_200MHZ (2)         /*80MHz */
#endif /*#ifndef IFXSCU_CFG_ASCLINSDIV_160MHZ_200MHZ */

// MCAN=> fsource1
#ifndef IFXSCU_CFG_MCANDIV_320MHZ_200MHZ
/** \brief Macro to configure CANDIV at 320MHz target frequency */
#define IFXSCU_CFG_MCANDIV_320MHZ_200MHZ    (2)      /* 100MHz */
#endif /*#ifndef IFXSCU_CFG_MCANDIV_320MHZ_200MHZ */

#ifndef IFXSCU_CFG_MCANDIV_160MHZ_200MHZ
/** \brief Macro to configure CANDIV at 160MHz target frequency */
#define IFXSCU_CFG_MCANDIV_160MHZ_200MHZ    (2)      /*100MHz */
#endif /*#ifndef IFXSCU_CFG_MCANDIV_160MHZ_200MHZ */

// fsource1
#ifndef IFXSCU_CFG_MSCDIV_160MHZ_200MHZ
/** \brief Macro to configure CANDIV at 160MHz target frequency */
#define IFXSCU_CFG_MSCDIV_160MHZ_200MHZ     (1)     /*160Mhz*/
#endif /*#ifndef IFXSCU_CFG_MSCDIV_160MHZ_200MHZ */

#ifndef IFXSCU_CFG_MSCDIV_320MHZ_200MHZ
/** \brief Macro to configure CANDIV at 320MHz target frequency */
#define IFXSCU_CFG_MSCDIV_320MHZ_200MHZ     (2)     /*160Mhz */
#endif /*#ifndef IFXSCU_CFG_MSCDIV_320MHZ_200MHZ */

// fsource2
#ifndef IFXSCU_CFG_QSPIDIV_320MHZ_200MHZ
/** \brief Macro to configure QSPIDIV at 200MHz target frequency */
#define IFXSCU_CFG_QSPIDIV_320MHZ_200MHZ    (1)      /*Max: 200MHz */
#endif /*#ifndef IFXSCU_CFG_QSPIDIV_200MHZ */

#ifndef IFXSCU_CFG_QSPIDIV_160MHZ_200MHZ
/** \brief Macro to configure QSPIDIV at 200MHz target frequency */
#define IFXSCU_CFG_QSPIDIV_160MHZ_200MHZ    (1)      /*Max: 200MHz */
#endif /*#ifndef IFXSCU_CFG_QSPIDIV_200MHZ */

// fsource1
#ifndef IFXSCU_CFG_ERAYDIV_160MHZ_200MHZ
/** \brief Macro to configure ERAYDIV at 160MHz target frequency */
#define IFXSCU_CFG_ERAYDIV_160MHZ_200MHZ    (2)     /*Max: 80MHz */
#endif /*#ifndef IFXSCU_CFG_ERAYDIV_160MHZ */

#ifndef IFXSCU_CFG_ERAYDIV_320MHZ_200MHZ
/** \brief Macro to configure ERAYDIV at 320MHz target frequency */
#define IFXSCU_CFG_ERAYDIV_200MHZ_3200MHZ    (4)     /*Max: 80MHz */
#endif /*#ifndef IFXSCU_CFG_ERAYDIV_320MHZ */

#ifndef IFXSCU_CFG_CLKSELMCAN
/** \brief Macro to configure CLKSELMCAN at all target frequency */
#define IFXSCU_CFG_CLKSELMCAN               (1) /*fsource1 */
#endif /*#ifndef IFXSCU_CFG_CLKSELMCAN */

#ifndef IFXSCU_CFG_CLKSELMSC
/** \brief Macro to configure CLKSELMSC at all target frequency */
#define IFXSCU_CFG_CLKSELMSC                (1) /*fsource1 */
#endif /*#ifndef IFXSCU_CFG_CLKSELMSC */

#ifndef IFXSCU_CFG_CLKSELQSPI
/** \brief Macro to configure CLKSELQSPI at all target frequency */
#define IFXSCU_CFG_CLKSELQSPI               (2) /*fsource2 */
#endif /*#ifndef IFXSCU_CFG_CLKSELQSPI */

#ifndef IFXSCU_CFG_CLKSELASCLINS
/** \brief Macro to configure CLKASCLINS at all target frequency */
#define IFXSCU_CFG_CLKSELASCLINS            (1) /*fsource1 */
#endif /*#ifndef IFXSCU_CFG_CLKSELASCLINS */

/** \brief Macros to configure FLASH.FCON register for flash waitstate configuration.
 *  \ref IfxScu_InitialStepConfig
 */

// FIXME To do later
/** \brief Macros to configure FLASH.FCON registers */
#define IFXSCU_CFG_FLASH_WAITSTATE_MSK 0

#define IFXSCU_CFG_FLASH_WAITSTATE_VAL_BASIC_(pll0Freq) 0

#define IFXSCU_CFG_FLASH_WAITSTATE_VAL_BASIC(pll0Freq)  IFXSCU_CFG_FLASH_WAITSTATE_VAL_BASIC_(pll0Freq)

#define IFXSCU_CFG_FLASH_WAITSTATE_VAL IFXSCU_CFG_FLASH_WAITSTATE_VAL_BASIC(IFXSCU_CFG_PLL_FREQ)

/** \brief Macros to configure CCUCON0 Clock distribution */
#define IFXSCU_CFG_CCUCON0_MASK                                      \
    (                                                                \
        (IFX_SCU_CCUCON0_STMDIV_MSK << IFX_SCU_CCUCON0_STMDIV_OFF) | \
        (IFX_SCU_CCUCON0_GTMDIV_MSK << IFX_SCU_CCUCON0_GTMDIV_OFF) | \
        (IFX_SCU_CCUCON0_SRIDIV_MSK << IFX_SCU_CCUCON0_SRIDIV_OFF) | \
        (IFX_SCU_CCUCON0_SPBDIV_MSK << IFX_SCU_CCUCON0_SPBDIV_OFF) | \
        (IFX_SCU_CCUCON0_BBBDIV_MSK << IFX_SCU_CCUCON0_BBBDIV_OFF) | \
        (IFX_SCU_CCUCON0_FSIDIV_MSK << IFX_SCU_CCUCON0_FSIDIV_OFF) | \
        (IFX_SCU_CCUCON0_FSI2DIV_MSK << IFX_SCU_CCUCON0_FSI2DIV_OFF))

#define IFXSCU_CFG_CCUCON0_BASIC_(pll0Freq)                              \
    (uint32)(                                                            \
        (IFXSCU_CFG_STMDIV_##pll0Freq << IFX_SCU_CCUCON0_STMDIV_OFF) |   \
        (IFXSCU_CFG_GTMDIV_##pll0Freq << IFX_SCU_CCUCON0_GTMDIV_OFF) |   \
        (IFXSCU_CFG_SRIDIV_##pll0Freq << IFX_SCU_CCUCON0_SRIDIV_OFF) |   \
        (IFXSCU_CFG_SPBDIV_##pll0Freq << IFX_SCU_CCUCON0_SPBDIV_OFF) |   \
        (IFXSCU_CFG_BBBDIV_##pll0Freq << IFX_SCU_CCUCON0_BBBDIV_OFF) |   \
        (IFXSCU_CFG_FSI2DIV_##pll0Freq << IFX_SCU_CCUCON0_FSI2DIV_OFF) | \
        (IFXSCU_CFG_FSIDIV_##pll0Freq << IFX_SCU_CCUCON0_FSIDIV_OFF))

