Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/iLLD_39A/Tricore/_Impl/IfxScu_cfg.h
#define IFXSCU_CFG_CCUCON0_BASIC(pll0Freq) IFXSCU_CFG_CCUCON0_BASIC_(pll0Freq)

#define IFXSCU_CFG_CCUCON0 IFXSCU_CFG_CCUCON0_BASIC(IFXSCU_CFG_PLL_FREQ)

/** \brief Macros to configure CCUCON1 Clock distribution */
#define IFXSCU_CFG_CCUCON1_MASK                                              \
    (                                                                        \
        (IFX_SCU_CCUCON1_MCANDIV_MSK << IFX_SCU_CCUCON1_MCANDIV_OFF) |       \
        (IFX_SCU_CCUCON1_MSCDIV_MSK << IFX_SCU_CCUCON1_MSCDIV_OFF) |         \
        (IFX_SCU_CCUCON1_QSPIDIV_MSK << IFX_SCU_CCUCON1_QSPIDIV_OFF) |       \
        (IFX_SCU_CCUCON1_CLKSELMCAN_MSK << IFX_SCU_CCUCON1_CLKSELMCAN_OFF) | \
        (IFX_SCU_CCUCON1_CLKSELMSC_MSK << IFX_SCU_CCUCON1_CLKSELMSC_OFF) |   \
        (IFX_SCU_CCUCON1_CLKSELQSPI_MSK << IFX_SCU_CCUCON1_CLKSELQSPI_OFF))

#define IFXSCU_CFG_CCUCON1_BASIC_(pll1Freq, pll2Freq)                                 \
    (uint32)(                                                                         \
        (IFXSCU_CFG_MCANDIV_##pll1Freq##_##pll2Freq << IFX_SCU_CCUCON1_MCANDIV_OFF) | \
        (IFXSCU_CFG_MSCDIV_##pll1Freq##_##pll2Freq << IFX_SCU_CCUCON1_MSCDIV_OFF) |   \
        (IFXSCU_CFG_QSPIDIV_##pll1Freq##_##pll2Freq << IFX_SCU_CCUCON1_QSPIDIV_OFF) | \
        (IFXSCU_CFG_CLKSELMCAN << IFX_SCU_CCUCON1_CLKSELMCAN_OFF) |                   \
        (IFXSCU_CFG_CLKSELMSC << IFX_SCU_CCUCON1_CLKSELMSC_OFF) |                     \
        (IFXSCU_CFG_CLKSELQSPI << IFX_SCU_CCUCON1_CLKSELQSPI_OFF))

#define IFXSCU_CFG_CCUCON1_BASIC(pll1Freq, pll2Freq) IFXSCU_CFG_CCUCON1_BASIC_(pll1Freq, pll2Freq)

#define IFXSCU_CFG_CCUCON1 IFXSCU_CFG_CCUCON1_BASIC(IFXSCU_CFG_PLL1_FREQ, IFXSCU_CFG_PLL2_FREQ)

/** \brief Macros to configure CCUCON2 Clock distribution */
#define IFXSCU_CFG_CCUCON2_MASK                                                    \
    (                                                                              \
        (IFX_SCU_CCUCON2_ASCLINFDIV_MSK << IFX_SCU_CCUCON2_ASCLINFDIV_OFF) |       \
        (IFX_SCU_CCUCON2_CLKSELASCLINS_MSK << IFX_SCU_CCUCON2_CLKSELASCLINS_OFF) | \
        (IFX_SCU_CCUCON2_ASCLINSDIV_MSK << IFX_SCU_CCUCON2_ASCLINSDIV_OFF))

#define IFXSCU_CFG_CCUCON2_BASIC_(pll1Freq, pll2Freq)                                       \
    (uint32)(                                                                               \
        (IFXSCU_CFG_ASCLINFDIV_##pll1Freq##_##pll2Freq << IFX_SCU_CCUCON2_ASCLINFDIV_OFF) | \
        (IFXSCU_CFG_CLKSELASCLINS << IFX_SCU_CCUCON2_CLKSELASCLINS_OFF) |                   \
        (IFXSCU_CFG_ASCLINSDIV_##pll1Freq##_##pll2Freq << IFX_SCU_CCUCON2_ASCLINSDIV_OFF))

#define IFXSCU_CFG_CCUCON2_BASIC(pll1Freq, pll2Freq) IFXSCU_CFG_CCUCON2_BASIC_(pll1Freq, pll2Freq)

#define IFXSCU_CFG_CCUCON2 IFXSCU_CFG_CCUCON2_BASIC(IFXSCU_CFG_PLL1_FREQ, IFXSCU_CFG_PLL2_FREQ)

/** \brief Macros to configure CCUCON6 Clock distribution */
#define IFXSCU_CFG_CCUCON6_MASK \
    (                           \
        (IFX_SCU_CCUCON6_CPU0DIV_MSK << IFX_SCU_CCUCON6_CPU0DIV_OFF))

#define IFXSCU_CFG_CCUCON6_BASIC_(pll0Freq) \
    (uint32)(                               \
        (IFXSCU_CFG_CPU0DIV_##pll0Freq << IFX_SCU_CCUCON6_CPU0DIV_OFF))

#define IFXSCU_CFG_CCUCON6_BASIC(pll0Freq) IFXSCU_CFG_CCUCON6_BASIC_(pll0Freq)

#define IFXSCU_CFG_CCUCON6 IFXSCU_CFG_CCUCON6_BASIC(IFXSCU_CFG_PLL_FREQ)

/** \brief Macros to configure CCUCON7 Clock distribution */
#define IFXSCU_CFG_CCUCON7_MASK \
    (                           \
        (IFX_SCU_CCUCON7_CPU1DIV_MSK << IFX_SCU_CCUCON7_CPU1DIV_OFF))

#define IFXSCU_CFG_CCUCON7_BASIC_(pll0Freq) \
    (uint32)(                               \
        (IFXSCU_CFG_CPU1DIV_##pll0Freq << IFX_SCU_CCUCON7_CPU1DIV_OFF))

#define IFXSCU_CFG_CCUCON7_BASIC(pll0Freq) IFXSCU_CFG_CCUCON7_BASIC_(pll0Freq)

#define IFXSCU_CFG_CCUCON7 IFXSCU_CFG_CCUCON7_BASIC(IFXSCU_CFG_PLL_FREQ)

/** \brief Macros to configure CCUCON8 Clock distribution */
#define IFXSCU_CFG_CCUCON8_MASK \
    (                           \
        (IFX_SCU_CCUCON8_CPU2DIV_MSK << IFX_SCU_CCUCON8_CPU2DIV_OFF))

#define IFXSCU_CFG_CCUCON8_BASIC_(pll0Freq) \
    (uint32)(                               \
        (IFXSCU_CFG_CPU2DIV_##pll0Freq << IFX_SCU_CCUCON8_CPU2DIV_OFF))

#define IFXSCU_CFG_CCUCON8_BASIC(pll0Freq) IFXSCU_CFG_CCUCON8_BASIC_(pll0Freq)

#define IFXSCU_CFG_CCUCON8 IFXSCU_CFG_CCUCON8_BASIC(IFXSCU_CFG_PLL_FREQ)

/** \brief Macros to configure CCUCON9 Clock distribution */
#define IFXSCU_CFG_CCUCON9_MASK \
    (                           \
        (IFX_SCU_CCUCON9_CPU3DIV_MSK << IFX_SCU_CCUCON9_CPU3DIV_OFF))

#define IFXSCU_CFG_CCUCON9_BASIC_(pll0Freq) \
    (uint32)(                               \
        (IFXSCU_CFG_CPU3DIV_##pll0Freq << IFX_SCU_CCUCON9_CPU3DIV_OFF))

#define IFXSCU_CFG_CCUCON9_BASIC(pll0Freq) IFXSCU_CFG_CCUCON9_BASIC_(pll0Freq)

#define IFXSCU_CFG_CCUCON9 IFXSCU_CFG_CCUCON9_BASIC(IFXSCU_CFG_PLL_FREQ)

/** \brief Macros to configure CCUCON10 Clock distribution */
#define IFXSCU_CFG_CCUCON10_MASK \
    (                            \
        (IFX_SCU_CCUCON10_CPU4DIV_MSK << IFX_SCU_CCUCON10_CPU4DIV_OFF))

#define IFXSCU_CFG_CCUCON10_BASIC_(pll0Freq) \
    (uint32)(                                \
        (IFXSCU_CFG_CPU4DIV_##pll0Freq << IFX_SCU_CCUCON10_CPU4DIV_OFF))

#define IFXSCU_CFG_CCUCON10_BASIC(pll0Freq) IFXSCU_CFG_CCUCON10_BASIC_(pll0Freq)

#define IFXSCU_CFG_CCUCON10 IFXSCU_CFG_CCUCON10_BASIC(IFXSCU_CFG_PLL_FREQ)

/** \brief Macros to configure CCUCON11 Clock distribution */
#define IFXSCU_CFG_CCUCON11_MASK \
    (                            \
        (IFX_SCU_CCUCON11_CPU5DIV_MSK << IFX_SCU_CCUCON11_CPU5DIV_OFF))

#define IFXSCU_CFG_CCUCON11_BASIC_(pll0Freq) \
    (uint32)(                                \
        (IFXSCU_CFG_CPU5DIV_##pll0Freq << IFX_SCU_CCUCON11_CPU5DIV_OFF))

#define IFXSCU_CFG_CCUCON11_BASIC(pll0Freq) IFXSCU_CFG_CCUCON11_BASIC_(pll0Freq)

#define IFXSCU_CFG_CCUCON11 IFXSCU_CFG_CCUCON11_BASIC(IFXSCU_CFG_PLL_FREQ)

#define IFXSCU_CFG_CLK_DISTRIBUTION                                                              \
    {                                                                                            \
/*	    {	uint32 value,			 uint32 mask					}*/                          \
        {IFXSCU_CFG_CCUCON0, IFXSCU_CFG_CCUCON0_MASK},   /*IfxScuCcu_CcuconRegConfig ccucon0;*/  \
        {IFXSCU_CFG_CCUCON1, IFXSCU_CFG_CCUCON1_MASK},   /*IfxScuCcu_CcuconRegConfig ccucon1;*/  \
        {IFXSCU_CFG_CCUCON2, IFXSCU_CFG_CCUCON2_MASK},   /*IfxScuCcu_CcuconRegConfig ccucon2;*/  \
        {IFXSCU_CFG_CCUCON6, IFXSCU_CFG_CCUCON6_MASK},   /*IfxScuCcu_CcuconRegConfig ccucon6;*/  \
        {IFXSCU_CFG_CCUCON7, IFXSCU_CFG_CCUCON7_MASK},   /*IfxScuCcu_CcuconRegConfig ccucon7;*/  \
        {IFXSCU_CFG_CCUCON8, IFXSCU_CFG_CCUCON8_MASK},   /*IfxScuCcu_CcuconRegConfig ccucon8;*/  \
        {IFXSCU_CFG_CCUCON9, IFXSCU_CFG_CCUCON9_MASK},   /*IfxScuCcu_CcuconRegConfig ccucon9;*/  \
        {IFXSCU_CFG_CCUCON10, IFXSCU_CFG_CCUCON10_MASK}, /*IfxScuCcu_CcuconRegConfig ccucon10;*/ \
        {IFXSCU_CFG_CCUCON11, IFXSCU_CFG_CCUCON11_MASK}  /*IfxScuCcu_CcuconRegConfig ccucon11;*/ \
    }

/*Utility macros for the configuration structure */

#define IFXSCU_CFG_FLASH_WAITSTATE       \
/*	{	uint32 value,			uint32 mask					}*/\
    {IFXSCU_CFG_FLASH_WAITSTATE_VAL, IFXSCU_CFG_FLASH_WAITSTATE_MSK}

#if (IFX_CFG_SCU_XTAL_FREQUENCY == (20000000))
#define IFXSCU_CFG_XTAL_FREQ        20MHZ
#elif (IFX_CFG_SCU_XTAL_FREQUENCY == (40000000))
#define IFXSCU_CFG_XTAL_FREQ        40MHZ
#elif (IFX_CFG_SCU_XTAL_FREQUENCY == (16000000))
#define IFXSCU_CFG_XTAL_FREQ        16MHZ
#elif (IFX_CFG_SCU_XTAL_FREQUENCY == (8000000))
#define IFXSCU_CFG_XTAL_FREQ        8MHZ
#else
#error "Wrong XTAL frequency configuration! check IFX_CFG_SCU_XTAL_FREQUENCY configuration in Ifx_Cfg.h."
#error "AurixPlus Triboard supported crystal frequencies are 16MHz, 20MHz, 25MHz and 40MHz"
#endif

#if (IFX_CFG_SCU_PLL_FREQUENCY == (80000000))
#define IFXSCU_CFG_PLL_FREQ 80MHZ
#elif (IFX_CFG_SCU_PLL_FREQUENCY == (133000000)) && (IFX_CFG_SCU_XTAL_FREQUENCY != (8000000))
#define IFXSCU_CFG_PLL_FREQ 133MHZ
#elif (IFX_CFG_SCU_PLL_FREQUENCY == (160000000))
#define IFXSCU_CFG_PLL_FREQ 160MHZ
#elif (IFX_CFG_SCU_PLL_FREQUENCY == (200000000))
#define IFXSCU_CFG_PLL_FREQ 200MHZ
#elif (IFX_CFG_SCU_PLL_FREQUENCY == (240000000))
#define IFXSCU_CFG_PLL_FREQ 240MHZ
#elif (IFX_CFG_SCU_PLL_FREQUENCY == (300000000))
#define IFXSCU_CFG_PLL_FREQ 300MHZ
#else
#error "Wrong PLL frequency configuration!, check IFX_CFG_SCU_PLL_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PLL1 frequencies are 80MHz, 133MHz, 160Mhz, 200MHz, 240Mhz, and 300MHz."
#endif

#if (IFX_CFG_SCU_PLL1_FREQUENCY == (320000000))
#define IFXSCU_CFG_PLL1_FREQ     320MHZ
#elif (IFX_CFG_SCU_PLL1_FREQUENCY == (160000000))
#define IFXSCU_CFG_PLL1_FREQ     160MHZ
#else
#error "Wrong PLL1 frequency configuration!, check IFX_CFG_SCU_PLL1_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PLL1 frequencies are 160MHz and 320MHz."
#endif

#if (IFX_CFG_SCU_PLL2_FREQUENCY == (200000000))
#define IFXSCU_CFG_PLL2_FREQ 200MHZ
#else
#error "Wrong PLL2 frequency configuration!, check IFX_CFG_SCU_PLL2_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PLL2 frequency is 200MHz."
#endif


/******************************************************************************/
/*---------------------------LBIST Config Macros------------------------------*/
/******************************************************************************/
#ifndef IFXSCULBIST_CFG_POWERTRAINSIGNATURE
#define IFXSCULBIST_CFG_POWERTRAINSIGNATURE (0x9EEA0A9FU)
#endif

#ifndef IFXSCULBIST_CFG_POWERTRAINPATTERN
#define IFXSCULBIST_CFG_POWERTRAINPATTERN   (0x40U)
#endif

#ifndef IFXSCULBIST_CFG_SEED
#define IFXSCULBIST_CFG_SEED                (7)
#endif

#ifndef IFXSCULBIST_CFG_ADASSIGNATURE
#define IFXSCULBIST_CFG_ADASSIGNATURE       (0xC2A1FAF9U)
#endif

#ifndef IFXSCULBIST_CFG_ADASPATTERN
#define IFXSCULBIST_CFG_ADASPATTERN         (0x280U)
#endif

/*                           Enum                                             */
/******************************************************************************/
/** Clock selection  */
typedef enum
{
    IfxScu_CCUCON0_CLKSEL_fBack = 0,
    IfxScu_CCUCON0_CLKSEL_fPll  = 1
} IfxScu_CCUCON0_CLKSEL;

/** Input frequency request control */
typedef enum
{
    IfxScu_WDTCON1_IR_divBy16384 = 0,
    IfxScu_WDTCON1_IR_divBy256   = 1,
    IfxScu_WDTCON1_IR_divBy64    = 2
} IfxScu_WDTCON1_IR;

typedef enum
{
    IfxScu_PMCSR_REQSLP_Run   = 0U, /* 00 Request CPU Run Mode */
    IfxScu_PMCSR_REQSLP_Idle  = 1U, /* 01 Request CPU Idle Mode */
    IfxScu_PMCSR_REQSLP_Sleep = 2U, /* 10 Request CPU System Sleep Mode */
    IfxScu_PMCSR_REQSLP_Stby  = 3U  /* 11 Request System Standby Mode */
} IfxScu_PMCSR_REQSLP;

/******************************************************************************/

#endif /* IFXSCU_CFG_H */
